Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Good Luck, Hero!.tmx
Source language: ko_kr
Languages: en_us

source: 거기서 뭐 해?
en_us: what are you doing over there?

source: 협조할게.
en_us: i’ll cooperate with you.

source: 개소리를⋯
en_us: nonsense...

source: 오후에 있는 화상 회의 준비는 어떻게 됐죠?
en_us: how did the preparations for the video conference this afternoon go?

source: 아유, 아가씨.
en_us: ugh, my lady.

source: 함정이면 어떡하려고?
en_us: what if it’s a trap?

source: 허튼짓하면 그냥 찔러버리는 수가 있어.
en_us: if you do anything rash, i might just stab her.

source: 심드렁...
en_us: jeez...

source: 휙휙
en_us: wave wave

source: 가인이 너, 삼촌들이 따라다니는 건 눈에 띄어서 싫다며.
en_us: ga-in, you told me before that you don’t like your uncles following you because it drew too much attention.

source: 본인은 납치 감금법 이면서?
en_us: that’s funny, coming from a kidnapper.

source: 거기에 도연화 이사는 성격도 만만치 않⋯
en_us: on top of that, director yeonhwa do’s personality is-

source: 과연 이사장님 좋아하실까···
en_us: i wonder if director will like it...

source: 듣는 사람 속 터지니까.
en_us: you have a tendency to drive the listener mad.

source: 얘 좀 수상한 짓 하고 다니는 것 같은데요?
en_us: i think he’s been up to something.

source: 침착하게 생각해.
en_us: think patiently.

source: 이것도 안 된다, 저것도 안 된다⋯
en_us: can’t do this, can’t do that...

source: 삐걱
en_us: stiff

source: 나도 이 일을 어떻게 처리할지 생각해야 했으니까.
en_us: i am trying to think of how to best resolve this issue myself.

source: 수돗물 주려다가 내가 참는⋯
en_us: i was going to give you tap water but i’ll-

source: 저쪽이다!
en_us: over there!

source: ...뭐야.
en_us: what the...

source: 어려운 일도 아니잖아.
en_us: it’s not even a difficult task.

source: 아⋯ 또다.
en_us: ah... again.

source: 역시 방식을 바꿀까요?
en_us: should we change our methods?

source: 뭐라고요?!
en_us: what did you just say?!

source: 기계처럼 공부랑 일만 하고⋯
en_us: always studying and working like a machine...

source: 도연화랑 백 비서님이 싸웠다고?
en_us: director do and mr. baek had a fight?

source: 아니, 글쎄 그 양반이 거하게 사고를 치고 그대로 쌩~ 도망갔지 뭐야?
en_us: you know what he did? he fled after making a gigantic mistake with it.

source: 나 걱정돼요.
en_us: i’m worried.

source: 그래서 나는 항상 궁금했어.
en_us: that’s why i was always curious.

source: TV에서 본 것 같은데⋯
en_us: i feel like i saw you on tv somewhere...

source: 행운을 빌어요, 공주님.
en_us: ...i wish you good luck, princess.

source: 미친 거 아냐?!
en_us: are they out of their minds?!

source: 또 도연화 얘기야!
en_us: she’s talking about yeonhwa again!

source: 또 아빠가 시킨 거예요?
en_us: did my dad put you up to this again?

source: 진짜 모른다고.
en_us: i really don’t know.

source: - 50화 -
en_us: episode 50

source: 내 생각엔⋯
en_us: i think...

source: 대표 이사 비서팀에 수행 비서 인력이 갑자기 빠져서 급했나 봐.
en_us: they must’ve been in a rush because their secretary in training suddenly dropped out.

source: 백영웅 씨를 괘씸하게 여긴 것과는 별개로.
en_us: it’s not related to my frustrations with you.

source: 아하~
en_us: aha!

source: 음식을 거부하는 계나리라니, 진짜일 리가 없잖아⋯
en_us: nari gye rejecting food... this can’t be real.

source: 휘적
en_us: wave

source: 그래서 말인데, 이번에는 내가 물어볼게.
en_us: so, let me ask a question now.

source: 전에는 잘만 치더니 이제 와서 양심에 찔리셨나?
en_us: you had no problem hitting me before. have you grown a conscience all of a sudden?

source: 이제 와서 그런 생각 하는 건 좀 늦지 않았어요?
en_us: don’t you think it’s a bit too late to think like that?

source: 그럼 네 동생 보고 갚으라고 할까?
en_us: then should i ask your little brother to pay us back?

source: 난 빼고 싸웠으면 좋겠다, 제발.
en_us: leave me out of this fight, please.

source: 왜 안 먹고 있어?
en_us: why aren’t you eating?

source: 오타 봐라···
en_us: these typos...

source: 저 사람들한테 가까이 가지 마!
en_us: don’t get too close to those people!

source: 털썩
en_us: plop

source: 다행히 얻어맞진 않았어.
en_us: thankfully, i wasn’t beaten.

source: 허어⋯?
en_us: huh...?

source: 회사는 무슨, 깡패 집단이지.
en_us: company? you all are a bunch of thugs.

source: 쾅쾅쾅!
en_us: boom boom boom!

source: 아주 좋아요.
en_us: very good.

source: 에이씨⋯
en_us: dang it...

source: 실장님, 여기 있는 건 다 확인했어요.
en_us: ms. gye, i’ve checked everything on this side.

source: 백영웅 씨랑 아는 사이네?
en_us: apparently, he knows mr. hero baek.

source: 덜덜..
en_us: shake shake

source: 안녕하세요~
en_us: hello!

source: 쩍
en_us: sh

source: 하암-
en_us: yawn

source: 기본이 안 되어 있어.
en_us: he lacks the basics.

source: 아, 맞다!
en_us: ah, right!

source: 어어어어 어어어어~
en_us: oh pleeease...

source: 저번 생에 나한테 무슨 짓을 한 겁니까?
en_us: what did you do to me in the past?

source: 사진발만 잘 받는 줄 알았는데.
en_us: and here i thought he was just photogenic.

source: 됐습니다.
en_us: i’m fine.

source: 자, 이건 선물.
en_us: here, a present.

source: 나는 돈도 없고 힘도 없고...
en_us: i don’t have much money or power...

source: 한결 씨!
en_us: mr. hangyeol!

source: 아는데ꞏꞏꞏ
en_us: i know, but...

source: 생일에 혼자 일이나 하고 있을 도연화 생각하면 가엾어서 원⋯
en_us: it’s just pitiful to think about poor ol’ yeonhwa do on her birthday, probably by herself and working. oh, my heart bleeds for you...

source: 엥, 한결이?
en_us: eh? hangyeol?

source: 걘 맞서 싸우기보다는 무시로 일관하는 쪽인데 말이지⋯
en_us: usually, she leans more towards ignoring rather than fight-

source: ⋯정가인 씨의 일은 형사 처분까지 가지 않을 겁니다.
en_us: when it comes to ms. ga-in, it won’t go into prosecution.

source: 그러고 보니⋯
en_us: come to think of it...

source: 어.
en_us: yup.

source: 뭐ꞏꞏꞏ
en_us: what...

source: 네에, 제 입장을 존중하고 협력하도록 노력하겠다고요.
en_us: okay, you will do your best to treat me with more respect and cooperate better?

source: 후두둑
en_us: slide

source: 죄송합니다!
en_us: i’m sorry!

source: 아껴 쓰시라고요⋯
en_us: ...be frugal about it...

source: 지금 그쪽 목숨줄 쥐고 있는 사람은 나야.
en_us: i’m the one holding your life in my hands.

source: 약속⋯ 이라고 하기에는 애매하지만, 어쨌든.
en_us: it’s not really much of a... promise, but still.

source: 자, 잠깐만 기다려주세요오오오~!
en_us: p-please wait just a little longer~!

source: 짱이다!
en_us: that’s awesome!

source: 오후 8:47
en_us: 8:47pm

source: 대룡그룹 회장의 딸, 도연화로 환생했다는 사실을.
en_us: ...had been reincarnated as yeonhwa do, the daughter of the chairman of dragon group.

source: 지금 괜찮은 거 맞아?
en_us: are you sure you’re okay?

source: 아, 정말이지!
en_us: agh, seriously!

source: 이상해.
en_us: that was so weird.

source: ⋯네?
en_us: huh...?

source: 어쩔 수 없는 사정이ꞏꞏꞏ
en_us: we didn’t have any choice...

source: 서프라이즈~!
en_us: surprise~

source: 한결이 어쨌어.
en_us: what did you do with hangyeol?

source: 네가 그런 사람들한테 시다렬왔다는 것도 알겠어.
en_us: i get that you suffered due to those people as well.

source: 강준혁 냉정해⋯
en_us: junhyuk kang, that’s so cold...

source: 첫 출연인데 동시간대에 방영하는 게 너무 유명해서⋯
en_us: it’s my first tv appearance, and the show airing at the same time is so famous...

source: 그럴 리가 있겠어요?!
en_us: n-no, of course not!

source: 뭐, 좋습니다.
en_us: fine.

source: 울컥...
en_us: touched

source: 반짝.
en_us: shine

source: 영웅 오빠?
en_us: hero?

source: 내 비서를 살인 미수범 옆에 둘 수는 없잖아요?
en_us: i can’t just leave my secretary next to someone who attempted murder, can i?

source: 대체 얼마나 거창하게 살 생각이길래 계속 만나자는 말을 하는 거지?{j}싶었다니까.
en_us: i was wondering how big you were gonna go for you to ask to meet me!{j}

source: 겔겔겔~
en_us: kekekek~

source: 저녁은
en_us: how about dinner?

source: 헉⋯.
en_us: huff...

source: 그렇다고 백영웅 씨 혼자 보낼 수는 없어요.
en_us: but i can’t just send you alone, mr. baek.

source: 백영웅, 너한테 부탁하는 거지.
en_us: i’m asking you, hero baek.

source: 생일이 뭐라고 저렇게 요란을 떠는 건지, 원.
en_us: what’s there to be so riled up about a birthday, i wonder...

source: 알아봐 줘서 고마워요.
en_us: thank you for investigating for me.

source: 앞으로는 백영웅 씨의 입장을 존중하고 협력하도록 노력하겠습니다.
en_us: from now on, i will do my best to treat you with more respect and cooperate with you better, mr. baek.

source: 오히려 잘됐어.
en_us: it’s better this way.

source: 대박인데?
en_us: that’s unheard of.

source: 이것만 엄청 낡았네.
en_us: why is this the only thing so worn out?

source: 뭐예요.
en_us: what do you need?

source: 구질구질한 가정사 설명하기 싫지만ꞏꞏꞏ
en_us: i don’t really want to talk about my messy family history...

source: 뭔 파티?
en_us: what party?

source: 먹자.
en_us: let’s go eat.

source: 사이에 낀 내가 다 뻘쭘했다니까.
en_us: it was so awkward being in the middle.

source: 둘이 알아서 해결할걸?
en_us: they have figure this out themselves.

source: 아직도 화 안 풀리신 거예요?
en_us: are you still angry?

source: 뭐, 어쩌겠어.
en_us: well, what can I do...

source: 협상 체결 된 거다?!
en_us: then, it’s a deal, okay?!

source: 카페모카
en_us: caffè mocha

source: 저질러버렸으니 이쪽에 전부 베팅할 수밖에.
en_us: since the cat’s out the bag, i might as well as bet everything on this side.

source: 톡
en_us: tap

source: 말도 안 돼.
en_us: impossible.

source: 쟤 너무 끈질겨서 안 엮이는 게 나아.
en_us: he never quits. it’s better not to get involved with him.

source: 쌔앵
en_us: whoosh

source: 인사해야지, 응?
en_us: do you want to say hi?

source: 그날, 나는 전부 기억해냈다.
en_us: i remembered everything that day.

source: 야아, 도연화~ 생일 축하한다!
en_us: ayyy, yeonhwaaa. happy birthday!

source: 미안하게 됐다...
en_us: i’m sorry...

source: 아버지가 보낸 선물 때문에 온 거거든?
en_us: i’m here because of my dad’s gift, all right?

source: 좀 허접한가···
en_us: is it too amateurish...?

source: 왜냐니까요.
en_us: again, why are you asking?

source: 아무리 이사님이 마왕의 환생이라지만 전생은 전생일 뿐이야.
en_us: even if director do is the reincarnation of the demon lord, the past is still the past.

source: 너무 오래 붙어 있지 마세요~
en_us: don’t stay too long around each other.

source: 일단 한결 씨한테 감시를 더 철저히 하라고 해야⋯
en_us: first, i gotta tell mr. seo to watch them more closely...

source: 그 사람이 나타나기 전까지는.
en_us: until she appeared in my life.

source: 으아아 개쪽팔려!!
en_us: ahhhh! so embarrassing!

source: 포도 싫어하면 다른 거 가져오고.
en_us: if you don’t like grape, i can get something else too.

source: 0000년 0월 00일 일요일
en_us: 0/00/0000 Sunday

source: 서한결
en_us: hangyeol seo

source: 생일 파티 시작까지 약 4시간.
en_us: 4 hours before the birthday party

source: 하아⋯
en_us: ha...

source: 아니지, 한결아.
en_us: no, hangyeol.

source: 주말에 뭐 하냐?
en_us: what are you doing on the weekend?

source: 씹냐?
en_us: are you ignoring me?

source: 세상에 나쁜 놈 많지.
en_us: there are a lot of bad people in the world.

source: 복수하게 해줘⋯!
en_us: ...who stole maria away from me...!

source: 엣헴
en_us: ahem

source: 이번에는 뭔가 다를지도 모른다고
en_us: ...while fully knowing that’s the type of person she is.

source: 전생의 기억을 토대로 쓴 글은 맞는 것 같은데, 중요한 부분이 생략되거나 바뀌어 있어.
en_us: this was definitely written based on our past lives, but important events have been either omitted or altered.

source: 신경 끄세요.
en_us: don’t worry about it.

source: 따르 르릉-
en_us: riiing

source: 잘 되고 있는 것 같아요!
en_us: i think it’s going well!

source: 그 애한테도 사정이 있었네요.'
en_us: ‘she was going through something as well.’

source: 너 예쁘잖아.
en_us: ...it’s because you’re pretty.

source: 계속 따라다녀 주세요.
en_us: keep following them.

source: 미워...
en_us: she sucks...

source: 언제쯤 제대로 치려나.
en_us: i wonder when he’ll type properly.

source: 뭘 어떻게 해.
en_us: what do you mean by that?

source: 나중에 링크 한 번만 다시 확인해주고.
en_us: just make sure to check all the links as well.

source: 날 그 시간에 가둔 사람들은 내 조재도 모른 채 잘 살아가는데.
en_us: especially since the people who trapped me in that time go on living well without even knowing my existence.

source: 나 죽고 나서 마왕님과 용사 사이에 무슨 일이 있었던 건가?
en_us: did something happen to my lord and the hero after i died?

source: 보아하니 충동적으로 저지른 일 같은데 잘 생각해보세요.
en_us: by the looks of it, you did this out of impulse, so think carefully.

source: 알아주셔서 감개무량해요.
en_us: i am honored to have been noticed.

source: 근데 저 연기 잘 하지 않았어요?
en_us: anyway, wasn’t i good at acting?

source: 그러니까 간섭할 생각하지 마.
en_us: ...so don’t even think about interfering.

source: 으랴!
en_us: hell yeah!

source: 허억.
en_us: ack!

source: 뭔가 꾸미고 있군.
en_us: they are scheming something.

source: 이제 가보세요.
en_us: you should go home now.

source: 아니면 무슨 일 있는 거야?
en_us: or is something up?

source: 아시잖아요.
en_us: you know this.

source: 아뇨, 괜찮아요.
en_us: no, it’s fine.

source: 씨익
en_us: grin

source: 겁도 없이...
en_us: foolishly...

source: 이사님 생일 파티⋯ 서프라이즈로 하기로 했었지?!
en_us: the director’s birthday party... was planned to be a surprise!

source: 내가 이사님한테 말 해줄 테니까...
en_us: i’ll pass it on to the director...

source: 그 과거에서 빠져나오는 건 참 어려워.
en_us: but it’s so hard to escape it.

source: 그건 왜...
en_us: for what...

source: 안녕하세요⋯
en_us: hello...

source: 또 나만 빼려고 하지!
en_us: trying to exclude me again?!

source: 쩌렁
en_us: blare

source: 다 지난 일로 이사님이랑 또 다투는 것도 싫고.
en_us: on top of that, i don’t want to fight with you again on something from the past.

source: 미쳤어요?
en_us: are you nuts?

source: 기도한다고 다 이뤄지냐⋯
en_us: praying doesn’t solve everything...

source: 갈 길이 멀다, 멀어⋯
en_us: still got long ways to go. very long indeed...

source: 숲은 위험해서 호위 없이 드나드시면 안 됩니다.
en_us: the forest is dangerous. you really mustn't go there without notice.

source: 성큼
en_us: step

source: 저지르고 난 후의 일을 각오했는지는 모르겠지만.
en_us: i don’t know if you’re prepared for the consequences...

source: 마왕이 내 용사님을 빼앗아 갈 거야⋯!
en_us: the demon lord is going to take my warrior away from me again...!

source: 벌컥
en_us: thud

source: 착각하지 마세요.
en_us: don’t be mistaken.

source: 오래 기다리지는 않을 테니 빨리 정리하도록 해요.
en_us: i won’t wait long, so i suggest you do it fast.

source: 그런데 요즘은 여유가 좀 생긴 것 같아서 다행이라고.
en_us: all i’m saying is that it’s quite nice to see you having some breathing room nowadays.

source: 우리 사장님 또 난리 나니까.
en_us: my boss is gonna lose it again.

source: 백 비서님, 무슨 일 있어요?
en_us: mr. baek, is something wrong?

source: 거봐요.
en_us: see?

source: 다시 태어난 걸 후회하게 만들어주겠어⋯!
en_us: i will make you regret ever being reborn...!

source: 탁.
en_us: tap

source: 이 녀석, 보는 눈이 있네요.
en_us: this boy has good eyes.

source: 와락
en_us: hug

source: 아는데⋯
en_us: but...

source: 풀썩-
en_us: plop

source: 자꾸 이런 말을 하는 게 문제라고.
en_us: the problem is that you keep saying these things.

source: 똑똑.
en_us: knock knock.

source: 아⋯ 백영웅이 보낸다고 한 그건가.
en_us: ah... is this the thing hero said he would send?

source: 시간을 드리죠.
en_us: i’ll give you some time.

source: 이사님이 그런 사람이라는 걸 잘 알고 있는 주제에
en_us: i looked forward to seeing her...

source: 하고 있나 궁금해서
en_us: so i was curious how you were doing.

source: 파티에, 백영웅 씨의 그 바보 같은 질문까지 생각하면⋯
en_us: mentioning a party, and that stupid question mr. baek asked...

source: 뭐요?
en_us: excuse me?

source: 당연히 거절해야지.
en_us: it’s the right thing to do.

source: 꾹
en_us: press

source: 들켰다고?
en_us: you said you’ve been found out?

source: 저번에 말했던 거기죠?
en_us: that’s the place you told me about last time, right?

source: 이미 다 들킨 것 같은데?
en_us: it seems like she’s already on to you two.

source: 괜히 좋아했네.
en_us: i got excited for nothing.

source: 마족의 땅에서 나오는 독기가 얼마나 강한데요!
en_us: do you know how strong the poisonous fumes emanating from the demon lands are?!

source: 덜덜
en_us: tremble tremble

source: 큰 키, 멀끔한 외모, 강한 의협심.
en_us: a tall stature, a neat appearance, and the strong desire to help those in need.

source: - 51화 -
en_us: - Episode 51 -

source: 등잔 밑이 어둡다더니 그 말이 딱 맞네.
en_us: they say you can be blind to those who are closest to you. i guess they were right.

source: 이사님도 제대로 사과해주세요.
en_us: ...i want a sincere apology from you too.

source: 자기가 한 말을 까먹으면 어떡해.
en_us: how could you forget what you yourself emphasized?

source: 마치 맨날 날 할퀴던 고양이가 처음으로 내 무릎에 올라온 듯한⋯
en_us: it feels as if a cat that always clawed me decided to climb into my lap...

source: 도와주실 수 있죠?
en_us: you can help me, right?

source: 용서 못 해!
en_us: i won’t!

source: 아니, 이사님한테 들키면 어쩌려고 그런 말을 했어요!
en_us: wait, why’d you say something like that?! what if ms. director had caught on!

source: 저는 사람 쉽게 손절 못 해요.
en_us: i have a hard time ending ties with people.

source: ⋯그러면
en_us: then...

source: 영웅 오빠는 나만의 용사님이었고
en_us: hero became my one and only warrior.

source: 평생 과거를 곱씹으면서 살아가는 건 너무나 쉬운데
en_us: it was so easy to relive and reflect on the past in my head all my life,

source: 그래도 잘할 수 있죠?
en_us: it won’t be a problem, right?

source: 이사님과 나는 아직도 냉전 중에 있다.
en_us: the cold shoulder was is still ongoing between the director and i.

source: 이런 선물은 처음 받아보는 것 같네···
en_us: i don’t think i’ve received a gift like this before...

source: 그러니까 그런 사람을 만나게 된다면
en_us: but if you do happen to meet those kinds of people...

source: 내가?
en_us: me?

source: 편 가르기 하자는 뜻이 아니에요.
en_us: i’m not taking sides here...

source: 차 놓치겠다.
en_us: we’re gonna miss the pick up.

source: 그럼 얼추 정리 다 된 것 같은데?
en_us: then i guess we’re pretty much done organizing them all.

source: 슬슬 오실 때 됐을걸요?
en_us: he’ll probably be here soon.

source: 물론 비서 입장에서는 최고의 보스지만...
en_us: of course, as a secretary, that’s the best kind of boss you can ask for...

source: 이런 건 맨날 다 내가 처리한다고 했잖아.
en_us: i’m always the one to clean up things like that.

source: 공주님!
en_us: my princess!

source: ···어린이집 현장 체험 학습 있어서요.
en_us: he’s on a kindergarten field trip...

source: 심지어 해고하려고 한 적도 있고.
en_us: and you even tried to fire me once.

source: 언제 오셨어요!!
en_us: when did you get here?!

source: 그리고 엄청 이쁜데!
en_us: and you are so pretty!

source: 어떡하죠...
en_us: what do we do?

source: ⋯사실 자세한 건 나도 잘 몰라⋯
en_us: in truth, i don’t know the details myself...

source: 나한테 잘 보여야 내가 놀아주지.
en_us: wouldn’t that go better if you were to help me out?

source: 으흠⋯
en_us: mhm...

source: 재밌게 놀구와 낼 보자
en_us: have fun. i’ll see you tomorrow.

source: 아니, 알아.
en_us: yeah, i know.

source: 쉬운 선택지를 두고 굳이 왜 이러는지 모르겠네.
en_us: i don’t understand why you’re choosing to do this with such an easy choice at hand.

source: 둥...
en_us: dun...

source: 바래다 드릴까요?
en_us: do you want me to escort you?

source: 할 말 실컷 다 하다가 본인이 불리하면 입 꾹 닫는 거,
en_us: you say all you want to say but become tight-lipped when at a disadvantage.

source: 바쁜 몸 움직이게 한 저쪽이 미안해야지.
en_us: he should be the one that’s sorry for wasting busy people’s time.

source: 좀 쳐다보는 시늉이라도 해주면 안 됩니까?
en_us: ...can you at least pretend to look at the speaker?

source: 아빠한테는 일단 비밀로 해주세요.
en_us: first and foremost, keep this a secret from my dad.

source: ⋯뭐?
en_us: what...?

source: 들어오라니까?
en_us: you should still join!

source: 혹시 데이트 신청이길 바라신 건⋯
en_us: or maybe, that’s what you wanted...?

source: 아오 왜 계속 통화중이야!
en_us: ugh, why is he still on another call?!

source: 사탕 같은 거.
en_us: they’re like candies.

source: 알고 보니 좋은 녀석 이었잖냐~
en_us: you’re better than i expected.

source: 먹엇ㅅ
en_us: i already at

source: 벌 컥
en_us: thud

source: 그런 거 없어도 들어줄 수 있는 거니까 그만 찡얼거려.
en_us: you don’t need either of those things for this, so stop whining.

source: 도연화가 누구랑 진심으로 싸웠다니, 별일이네.
en_us: seriously? yeonhwa genuinely fighting back is unexpected.

source: 마왕니이이임···
en_us: milorrrd...

source: 너, 지금 휴대폰 갖고 있어?
en_us: you. do you have a phone on you?

source: 나중에 여쭤봐요.
en_us: ask her later.

source: 아빠⋯
en_us: dad..

source: 역시 안 되겠다.
en_us: i can’t do it.

source: 그럼 주문은 제가 알아서 할게요!
en_us: i’ll just order a couple of things then!

source: 아니면 정가인 씨가 범인이라니까 이제 와서 그쪽 편이 들고 싶어졌어요?
en_us: or is it because you want to take ms. jeong’s side after finding out she is the culprit?

source: 마왕이, 마왕이⋯
en_us: the demon... the demon...

source: 이유를 왜 알아야 하지?
en_us: why do you need to know the reason?

source: ⋯됐어.
en_us: whatever...

source: ⋯그렇게까지 심한 건⋯
en_us: it’s not too ba-

source: 시비거냐?
en_us: you wanna fight?

source: 필요 없다 했는데도 굳이⋯
en_us: i said i don’t need it. he didn’t have to do this...

source: 너무 가까이 붙어 있지 마세요.
en_us: don’t stick too close to him.

source: 그치만 꼬투리 잡을 것도 다 떨어졌는데.
en_us: but i don’t have anything else to go after her with.

source: ⋯서한결 씨?
en_us: mr. hangyeol seo?

source: 언제는 싸가지 없다고 욕하셨으면서ꞏꞏꞏ
en_us: didn’t you say he was ill-mannered earlier...?

source: 이사님 퇴근 안 하셨나⋯?
en_us: director’s still at work...?

source: 한 번쯤은 용기 내서 내밀어진 손을 잡아보는 건 어때?
en_us: ...maybe it wouldn’t be too bad to muster up the courage to take their hand?

source: 가인이가 수줍음이 많네요~
en_us: ga-in is very shy...

source: 네⋯ 네에⋯
en_us: y-yeah...

source: 인맥 중심 사회가 얼마나 위험한 줄 알아?
en_us: do you know how dangerous a network-oriented society is?

source: 데이트 신청이라도 하는 줄 알고 식겁했네.
en_us: i thought you would ask me for a date or something.

source: 뭐, 좀 섭섭하긴 하지만⋯
en_us: well, it is a bit of a bummer...

source: 친구ꞏꞏꞏ
en_us: buddy...

source: 자만이 지나치네요.
en_us: your arrogance is excessive, mr. baek.

source: 그때는 꼭 한울이를 구해줘.
en_us: if that time ever comes, please save hanul.

source: 허어, 그래?
en_us: oho, is that so?

source: 엉?
en_us: huh?

source: 주말⋯?
en_us: the weekend?

source: 진짜 미쳤냐고요.
en_us: have you actually lost it?

source: 내가 왜?
en_us: why do i have to?

source: 자, 그럼...
en_us: okay, then...

source: 나는 네가 더 나은 사람을 만나기 위해 거치는 연습 상대라고 생각하면 돼.
en_us: you can think of me as practice before meeting said better people.

source: ⋯진심이에요?
en_us: are you being serious?

source: 진짜⋯
en_us: seriously...?

source: 꺄아-
en_us: shriek-

source: 그게, 금요일이 이사님 생⋯
en_us: the thing is, that friday is your b-

source: 좀 걸리는 게 있어서요.
en_us: i just have an inkling that’s bothering me.

source: 딱 봐도 속여먹기 좋으니까.
en_us: you look rather gullible.

source: 백영웅, 너를 많이 아낀다고.
en_us: what i’m saying is... my boss cherishes you, hero baek.

source: 후후, 벌써 최고의 파티가 될 것 같은 기분이⋯
en_us: hehe, it already feels like it’s going to be the best party ever...

source: 백 비서님, 대체 뭐 하고 있는 거예요!
en_us: mr. baek, what could be so important right now?!

source: 일단 가서 들어보는 게⋯
en_us: maybe it’ll be best to-

source: 내가 너무 경솔했다.
en_us: that was insensitive of me.

source: 쿡
en_us: stab

source: 그냥 지나갈걸...!
en_us: i should’ve just moved along...!

source: 들켰어!
en_us: i’ve been compromised!

source: 다치신 곳은...
en_us: are you hurt any-

source: 난 왜 이렇게 머리가 안 굴러가는 거야⋯!
en_us: why can’t my mind work any faster...?!

source: 돈도 벌고, 빚도 갚고.
en_us: you’ll be able to make money and pay your debt.

source: 에소프레소
en_us: espresso

source: 그러게요.
en_us: i know.

source: 겉보기에는 호의를 베푸는 것 같아도 철저하게 득실을 따지지.
en_us: it looks like you’re showing kindness and willingness to help on the surface, but people like you always ask for something in return.

source: 행운을 빌어요 용사님!
en_us: good luck, hero!

source: 내가 허락 안 했으면 당신은 그 방에서 나오지도 못했어요.
en_us: if i hadn’t given permission, you wouldn’t even be able to leave that room.

source: 어렸을 때부터 너는 좀 인간 같지가 않았잖아.
en_us: you weren’t very human-like ever since you were young, you know.

source: 그러게 말입니다⋯
en_us: i know how you feel...

source: 딱히 뭐 하는 건...
en_us: nothing particular, i think...

source: 아, 한 번만~
en_us: ah, come on, just this onceee!

source: 생일 축하해요, 마왕님!
en_us: happy birthday, milord!

source: 너희 또 애 괴롭히지!!!
en_us: you’re picking on someone again, aren’t you?!!!

source: 사랑하는 용사님을,
en_us: the warrior i loved,

source: 그럼 다음 생에서도
en_us: then, in your next life as well...

source: 앵알 앵알
en_us: bla bla

source: 하하⋯ 뭐⋯ 예의상⋯
en_us: haha... well... courtesy-wise...

source: 이제 서한결 씨의 사장님은 내가 아니라 가인이인 거야.
en_us: from now on, you are his new boss, ga-in, not me.

source: 그리고⋯
en_us: and...

source: 대체...
en_us: just what...

source: 아, 이렇게 귀한 걸 제가 받아도 괜찮은 건가요?
en_us: ah... is it really okay for me to have something so precious?

source: 꽃 선물은 되도록 자제해줬으면 하는 바람이 있어요.
en_us: ...but i hope we don’t get so many flowers this year.

source: 어떻게 하면 좋을지 더 생각해볼 것.
en_us: note: think of how to better improve the current circumstances

source: 그렇게 나는 환생했다.
en_us: just like that, i was reincarnated.

source: 요즘 사장님 연락도 뜸하니까 그 전까지는 자유인거.
en_us: and since boss isn’t calling often nowadays, i guess i’m free until then.

source: 초등학생 여자애가 당장 할 수 있는 일에는 한계가 있었기에
en_us: ...but there was little i could do as an elementary school girl.

source: 있자나요⋯
en_us: hey, so, ummm...

source: 얄팍한 동정심.
en_us: a shallow sympathy.

source: 글 ꞏ 그림 송현주
en_us: story and art by hyunju song

source: 그치만 기분은 좋네.
en_us: but at least i feel good.

source: 실장님 먼저 들어가세요.
en_us: go ahead without me, ms. gye.

source: 천천히 생각해라.
en_us: take your time.

source: 맙소사, 게다가 나랑 나이도 비슷한 애를ꞏꞏꞏ
en_us: oh my goodness, he looks around my age...

source: 한울, 이리 와.
en_us: hanul, come here.

source: 잘 됐네요.
en_us: well, that works out well then.

source: 모든 걸 돈으로 해결하려고 하는 습관은 역시 못 고치셨군.
en_us: but it looks like she still has the habit of trying to solve everything with money.

source: 도연화 이사는 여기서 무사히 나가면 놓아줄 거야.
en_us: i’ll let director do go once i’m safely out of here.

source: 음?
en_us: hmmm?

source: 음흉하게 웃네.
en_us: what’s with the sly smile...?

source: 인질극 벌이는 너나, 사람 감금하고 있는 우리 쪽이나 피장파장인 거.
en_us: or us imprisoning you, both situations are honestly a huge mess.

source: 그니까 담에 만나면 고맙습니다, 해.
en_us: next time when you see him, you tell him thank you, okay?

source: 아니죠.
en_us: no.
